In [1]:
import pandas as pd

In [7]:
xdata = {
    'Name': ['Alice', 'Bob', 'Claire'],
    'Age': [25, 30, 27],
    'Gender': ['Female', 'Male', 'Female']
}

In [8]:
data = pd.DataFrame(xdata)

In [9]:
data

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female